In [106]:
from proj_trial2 import *

# Practice Session Examples

In [110]:
session = SQLSession('jqkcl')

  ________            _____ ____    __
 /_  __/ /_  ___     / ___// __ \  / /
  / / / __ \/ _ \    \__ \/ / / / / /
 / / / / / /  __/   ___/ / /_/ / / /___
/_/ /_/ /_/\___/   /____/\___\_\/_____/

    ____                  __  _              __  __      __
   / __ \_________ ______/ /_(_)_______     / / / /_  __/ /_
  / /_/ / ___/ __ `/ ___/ __/ / ___/ _ \   / /_/ / / / / __ \
 / ____/ /  / /_/ / /__/ /_/ / /__/  __/  / __  / /_/ / /_/ /
/_/   /_/   \__,_/\___/\__/_/\___/\___/  /_/ /_/\__,_/_.___/


Welcome, jqkcl, to your SQL Practice Hub! Here you'll be able to practice writing SQL queries in 6 different topics and get instant feedback.

Choose a Topic.

Enter in the corresponding number for the topic you want to study. For example, if you would like to practice SQL JOINS, enter 6.
1 for Retrieve data from tables
2 for Boolean and Relational Operators
3 for Wildcard and Special operators
4 for Aggregate Functions
5 for Formatting query output
6 for SQL JOINS
Your choice:  2

************************************

Exercise:
From the following table, write a SQL query to find all orders that meet the following conditions. Exclude combinations of order date equal to '2012-08-17' or customer ID greater than 3005 and purchase amount less than 1000.

See sample table(s) below:
Table name: orders

ord_no      purch_amt   ord_date    customer_id  salesman_id
----------  ----------  ----------  -----------  -----------
70001       150.5       2012-10-05  3005         5002
70009       270.65      2012-09-10  3001         5005
70002       65.26       2012-10-05  3002         5001
70004       110.5       2012-08-17  3009         5003
70007       948.5       2012-09-10  3005         5002
70005       2400.6      2012-07-27  3007         5001
70008       5760        2012-09-10  3002         5001
70010       1983.43     2012-10-10  3004         5006
70003       2480.4      2012-10-10  3009         5003
70012       250.45      2012-06-27  3008         5002
70011       75.29       2012-08-17  3003         5007
70013       3045.6      2012-04-25  3002         5001

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select * from orders where ord_date != '2012-08-13' or (customer_id > 3005 and purch_amt > 1000)

************************************
Feedback:
The input SQL query is incorrect with fatal errors. The correct SQL query uses the NOT operator to invert the conditions in the WHERE clause. The input SQL query instead uses the != operator. The input SQL query also has the conditions in the WHERE clause in the wrong order. The correct order should have been (ord_date ='2012-08-17' OR customer_id>3005) AND purch_amt<1000.
Suggested topics to study: logical operators, order of operations in SQL
************************************

If you would like to try this question again, enter 1. If you would like to try a different question in this topic, enter 2. If you would like to try a new topic, enter 3. If you would like to exit your session, enter 4:  4

  ________                __                        __
 /_  __/ /_  ____ _____  / /__   __  ______  __  __/ /
  / / / __ \/ __ `/ __ \/ //_/  / / / / __ \/ / / / /
 / / / / / / /_/ / / / / ,<    / /_/ / /_/ / /_/ /_/
/_/ /_/ /_/\__,_/_/ /_/_/|_|   \__, /\____/\__,_(_)
                              /____/

We hope The SQL Practice Hub helped you learn SQL or prepare for your next interview :)

In [150]:
session = SQLSession('jqkcl')

  ________            _____ ____    __
 /_  __/ /_  ___     / ___// __ \  / /
  / / / __ \/ _ \    \__ \/ / / / / /
 / / / / / /  __/   ___/ / /_/ / / /___
/_/ /_/ /_/\___/   /____/\___\_\/_____/

    ____                  __  _              __  __      __
   / __ \_________ ______/ /_(_)_______     / / / /_  __/ /_
  / /_/ / ___/ __ `/ ___/ __/ / ___/ _ \   / /_/ / / / / __ \
 / ____/ /  / /_/ / /__/ /_/ / /__/  __/  / __  / /_/ / /_/ /
/_/   /_/   \__,_/\___/\__/_/\___/\___/  /_/ /_/\__,_/_.___/


Welcome, jqkcl, to your SQL Practice Hub! Here you'll be able to practice writing SQL queries in 6 different topics and get instant feedback.

Choose a Topic.

Enter in the corresponding number for the topic you want to study. For example, if you would like to practice SQL JOINS, enter 6.
1 for Retrieve data from tables
2 for Boolean and Relational Operators
3 for Wildcard and Special operators
4 for Aggregate Functions
5 for Formatting query output
6 for SQL JOINS
Your choice:  1

************************************

Exercise:
 From the following table, write a SQL query to combine the winners in 'Physiology' before 1971 and winners in 'Peace' on or after 1974. Return year, subject, winner, country, and category.

See sample table(s) below:
Table name: nobel_win


YEAR SUBJECT                   WINNER                                        COUNTRY                CATEGORY
---- ------------------------- --------------------------------------------- ------------------------- ------------
1970 Physics                   Hannes Alfven                                 Sweden                 Scientist
1970 Physics                   Louis Neel                                    France                 Scientist
1970 Chemistry                 Luis Federico Leloir                          France                 Scientist
1970 Physiology                Ulf von Euler                                 Sweden                 Scientist
1970 Physiology                Bernard Katz                                  Germany                Scientist
1970 Literature                Aleksandr Solzhenitsyn                        Russia                 Linguist
1970 Economics                 Paul Samuelson                                USA                    Economist
1970 Physiology                Julius Axelrod                                USA                    Scientist
1971 Physics                   Dennis Gabor                                  Hungary                Scientist
1971 Chemistry                 Gerhard Herzberg                              Germany                Scientist
1971 Peace                     Willy Brandt                                  Germany                Chancellor
1971 Literature                Pablo Neruda                                  Chile                  Linguist
1971 Economics                 Simon Kuznets                                 Russia                 Economist
1978 Peace                     Anwar al-Sadat                                Egypt                  President
1978 Peace                     Menachem Begin                                Israel                 Prime Minister
1987 Chemistry                 Donald J. Cram                                USA                    Scientist
1987 Chemistry                 Jean-Marie Lehn                               France                 Scientist
1987 Physiology                Susumu Tonegawa                               Japan                  Scientist
1994 Economics                 Reinhard Selten                               Germany                Economist
1994 Peace                     Yitzhak Rabin                                 Israel                 Prime Minister
1987 Physics                   Johannes Georg Bednorz                        Germany                Scientist
1987 Literature                Joseph Brodsky                                Russia                 Linguist
1987 Economics                 Robert Solow                                  USA                    Economist
1994 Literature                Kenzaburo Oe                                  Japan                  Linguist

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: selet WINNER from nobel_win where (SUBJECT = 'Physiology' and YEAR < 1971) or (SUBJECT = 'Peace' and year >= 1974)

Topic: Retrieve data from tables #21
************************************
Example solution:
SELECT * FROM nobel_win WHERE (subject ='Physiology' AND year<1971) UNION (SELECT * FROM nobel_win WHERE (subject ='Peace' AND year>=1974));

************************************
Feedback:
The input SQL query is incorrect with fatal and minor errors. The correct SQL query uses the UNION operator to combine the results of two different SQL queries. The input SQL query instead uses the OR operator. The minor errors are with typos in the column names. The input SQL query uses "WINNER" and "selet" instead of "winner" and "select".
Suggested topics to study: UNION operator, OR operator
************************************

If you would like to try this question again, enter 1. If you would like to try a different question in this topic, enter 2. If you would like to try a new topic, enter 3. If you would like to exit your session, enter 4:  4

  ________                __                        __
 /_  __/ /_  ____ _____  / /__   __  ______  __  __/ /
  / / / __ \/ __ `/ __ \/ //_/  / / / / __ \/ / / / /
 / / / / / / /_/ / / / / ,<    / /_/ / /_/ / /_/ /_/
/_/ /_/ /_/\__,_/_/ /_/_/|_|   \__, /\____/\__,_(_)
                              /____/

We hope The SQL Practice Hub helped you learn SQL or prepare for your next interview :)

# Interview Examples

In [152]:
SQLInterview('jqkcl', 2)

Welcome, jqkcl, to your SQL Interview Simulator. Here, you'll be asked 5 random SQL questions to assess your skills. At the end, you will be provided with feedback on each question.

************************************

Exercise:
From the following tables write a SQL query to select all rows from both participating tables as long as there is a match between pro_com and com_id.

See sample table(s) below:
Table name: company_mast

COM_ID COM_NAME
------ -------------
    11 Samsung
    12 iBall
    13 Epsion
    14 Zebronics
    15 Asus
    16 Frontech

Table name: item_mast

 PRO_ID PRO_NAME                       PRO_PRICE    PRO_COM
------- ------------------------- -------------- ----------
    101 Mother Board                    3200.00         15
    102 Key Board                        450.00         16
    103 ZIP drive                        250.00         14
    104 Speaker                          550.00         16
    105 Monitor                         5000.00         11
    106 DVD drive                        900.00         12
    107 CD drive                         800.00         12
    108 Printer                         2600.00         13
    109 Refill cartridge                 350.00         13
    110 Mouse                            250.00         12

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select * from company_mast c inner join item_mast i on c.COM_ID = i.PRO_COM

************************************

Exercise:
From the following table, write a SQL query to retrieve the details of the customers whose names begins with the letter 'B'. Return customer_id, cust_name, city, grade, salesman_id.

See sample table(s) below:
Table name: customer

 customer_id |   cust_name    |    city    | grade | salesman_id
-------------+----------------+------------+-------+-------------
        3002 | Nick Rimando   | New York   |   100 |        5001
        3007 | Brad Davis     | New York   |   200 |        5001
        3005 | Graham Zusi    | California |   200 |        5002
        3008 | Julian Green   | London     |   300 |        5002
        3004 | Fabian Johnson | Paris      |   300 |        5006
        3009 | Geoff Cameron  | Berlin     |   100 |        5003
        3003 | Jozy Altidor   | Moscow     |   200 |        5007
        3001 | Brad Guzan     | London     |       |        5005

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select * from customer where cust_name like 'B%'

Question 1 Results:
Topic: SQL JOINS. Question #21
************************************
Example solution:
SELECT *
   FROM item_mast
   INNER JOIN company_mast
   ON item_mast.pro_com= company_mast.com_id;

************************************
Feedback:
The input SQL query is correct. It would produce the same output as the solution SQL query. The only difference is the order of the tables. The solution SQL query has the item_mast table first and then the company_mast table. The input SQL query has the company_mast table first and then the item_mast table. The order of the tables does not matter in SQL.
Suggested topics to study: types of joins
Question 2 Results:
Topic: Wildcard and Special operators. Question #9
************************************
Example solution:
SELECT *
FROM customer
WHERE cust_name LIKE 'B%';

************************************
Feedback:
The input SQL query is correct. It would produce the same output as the solution SQL query. The only difference is that the solution SQL query has extra spaces which are not necessary.
  ________                __                        __
 /_  __/ /_  ____ _____  / /__   __  ______  __  __/ /
  / / / __ \/ __ `/ __ \/ //_/  / / / / __ \/ / / / /
 / / / / / / /_/ / / / / ,<    / /_/ / /_/ / /_/ /_/
/_/ /_/ /_/\__,_/_/ /_/_/|_|   \__, /\____/\__,_(_)
                              /____/

We hope The SQL Interview Simulator helped you get one step closer to getting your dream job! Good luck :)

In [149]:
SQLInterview('jqkcl')

Welcome, jqkcl, to your SQL Interview Simulator. Here, you'll be asked 5 random SQL questions to assess your skills. At the end, you will be provided with feedback on each question.

************************************

Exercise:
From the following tables write a SQL query to locate those salespeople who do not live in the same city where their customers live and have received a commission of more than 12% from the company. Return Customer Name, customer city, Salesman, salesman city, commission.

See sample table(s) below:
Table name: customer

 customer_id |   cust_name    |    city    | grade | salesman_id
-------------+----------------+------------+-------+-------------
        3002 | Nick Rimando   | New York   |   100 |        5001
        3007 | Brad Davis     | New York   |   200 |        5001
        3005 | Graham Zusi    | California |   200 |        5002
        3008 | Julian Green   | London     |   300 |        5002
        3004 | Fabian Johnson | Paris      |   300 |        5006
        3009 | Geoff Cameron  | Berlin     |   100 |        5003
        3003 | Jozy Altidor   | Moscow     |   200 |        5007
        3001 | Brad Guzan     | London     |       |        5005

Table name: salesman

 salesman_id |    name    |   city   | commission
-------------+------------+----------+------------
        5001 | James Hoog | New York |       0.15
        5002 | Nail Knite | Paris    |       0.13
        5005 | Pit Alex   | London   |       0.11
        5006 | Mc Lyon    | Paris    |       0.14
        5007 | Paul Adam  | Rome     |       0.13
        5003 | Lauson Hen | San Jose |       0.12

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select c.cust_name, c.city, c.salesman_id, s.city, s.commission from customer c, salesman s, where c.salesman_id = s.salesman_id and c.city != s.city and s.commission > .12

************************************

Exercise:
From the following table, write a SQL query to find all the customers in ‘New York’ city who have a grade value above 100. Return customer_id, cust_name, city, grade, and salesman_id.

See sample table(s) below:
Table name: customer

 customer_id |   cust_name    |    city    | grade | salesman_id
-------------+----------------+------------+-------+-------------
        3002 | Nick Rimando   | New York   |   100 |        5001
        3007 | Brad Davis     | New York   |   200 |        5001
        3005 | Graham Zusi    | California |   200 |        5002
        3008 | Julian Green   | London     |   300 |        5002
        3004 | Fabian Johnson | Paris      |   300 |        5006
        3009 | Geoff Cameron  | Berlin     |   100 |        5003
        3003 | Jozy Altidor   | Moscow     |   200 |        5007
        3001 | Brad Guzan     | London     |       |        5005

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select * from customer where city = 'New York' and grade > 100

************************************

Exercise:
From the following table, write a SQL query to determine the maximum order (purchase) amount generated by each salesperson. Filter the rows for the salesperson ID is in the range 5003 and 5008 (Begin and end values are included.). Return salesperson id and maximum purchase amount.

See sample table(s) below:
Table name: orders

ord_no      purch_amt   ord_date    customer_id  salesman_id
----------  ----------  ----------  -----------  -----------
70001       150.5       2012-10-05  3005         5002
70009       270.65      2012-09-10  3001         5005
70002       65.26       2012-10-05  3002         5001
70004       110.5       2012-08-17  3009         5003
70007       948.5       2012-09-10  3005         5002
70005       2400.6      2012-07-27  3007         5001
70008       5760        2012-09-10  3002         5001
70010       1983.43     2012-10-10  3004         5006
70003       2480.4      2012-10-10  3009         5003
70012       250.45      2012-06-27  3008         5002
70011       75.29       2012-08-17  3003         5007
70013       3045.6      2012-04-25  3002         5001

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select salesman_id, max(purch_amt) from orders where salesman_id in (5003, 5004, 5005, 5006, 5007, 5008) group by salesman_id

************************************

Exercise:
From the following table, write a SQL query to select all the salespeople. Return salesman_id, name, city, commission with the percent sign (%).

See sample table(s) below:
Table name: salesman

 salesman_id |    name    |   city   | commission
-------------+------------+----------+------------
        5001 | James Hoog | New York |       0.15
        5002 | Nail Knite | Paris    |       0.13
        5005 | Pit Alex   | London   |       0.11
        5006 | Mc Lyon    | Paris    |       0.14
        5007 | Paul Adam  | Rome     |       0.13
        5003 | Lauson Hen | San Jose |       0.12

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select salesman_id, name, city, concat(commission * 100, '%') from salesman

************************************

Exercise:
From the following table, write a SQL query to find the details of the customers whose names end with the letter 'n'. Return customer_id, cust_name, city, grade, salesman_id.

See sample table(s) below:
Table name: customer

 customer_id |   cust_name    |    city    | grade | salesman_id
-------------+----------------+------------+-------+-------------
        3002 | Nick Rimando   | New York   |   100 |        5001
        3007 | Brad Davis     | New York   |   200 |        5001
        3005 | Graham Zusi    | California |   200 |        5002
        3008 | Julian Green   | London     |   300 |        5002
        3004 | Fabian Johnson | Paris      |   300 |        5006
        3009 | Geoff Cameron  | Berlin     |   100 |        5003
        3003 | Jozy Altidor   | Moscow     |   200 |        5007
        3001 | Brad Guzan     | London     |       |        5005

Please enter in your solution as one line (do not hit the Enter or Return key, and do not enter new lines)

Enter your solution here: select * from customer where cust_name like '%n'

Question 1 Results:
************************************
Feedback:
The input SQL query is incorrect with fatal and minor errors. The correct SQL query uses an inner join while the input SQL query uses a regular join. An inner join only returns rows where there is a match in both tables while a regular join will return all rows from both tables, even if there is no match. In this case, both queries would produce the same output because all the rows in both tables match on the city column. The minor errors are with the column and table aliases. The solution SQL query uses the aliases "a" for the customer table and "b" for the salesman table. The input SQL query does not use any aliases. The solution SQL query also uses the column alias "Customer Name" for the customer name column. The input SQL query does not use any column aliases.
Suggested topics to study: types of joins, table and column aliases
Question 2 Results:
************************************
Feedback:
The input SQL query is correct. It would produce the same output as the solution SQL query. The only difference is that the input SQL query does not have spaces between each line while the solution SQL query does. This does not affect the output of the query.
Suggested topics to study: none
Question 3 Results:
************************************
Feedback:
The input SQL query is incorrect with fatal and minor errors. The solution SQL query uses the HAVING clause to filter the rows after the GROUP BY is applied. The input SQL query instead uses the WHERE clause to filter the rows before the GROUP BY is applied. This would produce different results. The minor error is that the input SQL query is missing a space between the max function and the open parenthesis.
Suggested topics to study: GROUP BY, HAVING, and ORDER BY clauses
Question 4 Results:
************************************
Feedback:
The input SQL query is correct. It would produce the same output as the solution SQL query. The only difference is that the input SQL query uses the CONCAT function while the solution SQL query uses the '%' wildcard. The CONCAT function concatenates two strings together while the '%' wildcard just adds the '%' character to the end of the commission value. In this case, both queries would produce the same output because the end result is the same.
Suggested topics to study: string functions
Question 5 Results:
************************************
Feedback:
The input SQL query is correct. It would produce the same output as the solution SQL query. The only difference is that the solution SQL query has extra spaces which are not necessary.
  ________                __                        __
 /_  __/ /_  ____ _____  / /__   __  ______  __  __/ /
  / / / __ \/ __ `/ __ \/ //_/  / / / / __ \/ / / / /
 / / / / / / /_/ / / / / ,<    / /_/ / /_/ / /_/ /_/
/_/ /_/ /_/\__,_/_/ /_/_/|_|   \__, /\____/\__,_(_)
                              /____/

We hope The SQL Interview Simulator helped you get one step closer to getting your dream job! Good luck :)